package com.example.listview_010_toon

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.widget.ArrayAdapter
import android.widget.Toast
import kotlinx.android.synthetic.main.activity_main.*

class MainActivity : AppCompatActivity() {

    val titleArr = arrayOf(
        "ภาวนา"
        , "รักติดไซเรน"
        , "ธารารัตน์","แอบดี","แก้มน้องนางนั้นแดงกว่าใคร","เวลาเธอยิ้ม"
        , "บอกฉัน", "ไม่รู้ทําไม", "ทางผ่าน", "ดวงใจ")

    val priceArr = arrayOf("พร้อมเดินจากไป พร้อมแล้ว\n" +
            "เตรียมใจเอาไว้ก่อนแล้ว แค่ยังทนไม่ไหว\n" +
            "พร้อมเดินจากไป พร้อมแล้ว\n" +
            "เตรียมใจเอาไว้นานแล้ว ต่อจากนี้คงไม่มี\n" +
            "เธออยู่ตรงนี้ อยู่กับฉัน ที่ได้มีแค่เรื่องเราสองคน\n" +
            "แต่ต่อจากนี้...\n" +
            "คงทำได้เพียงแค่ภาวนา ภาวนาไปก่อน\n" +
            "ก็รู้ดีว่าถึงฝืนไปคงเท่านั้น\n" +
            "เพราะว่าความเป็นจริงไม่ใช่ความฝัน\n" +
            "คงทำได้เพียงแค่ภาวนา ภาวนาไปก่อน\n" +
            "ก็รู้ดีว่าถึงฝืนไปคงเท่านั้น\n" +
            "เพราะว่าความเป็นจริง เธอไม่ได้รักกัน\n" +
            "พร้อมภาวนา พร้อมแล้ว\n" +
            "เตรียมใจเอาไว้ก่อนแล้ว แต่ยังทำไม่ได้\n" +
            "เธออยู่ตรงนี้ อยู่กับฉัน ที่ได้มีแค่เรื่องเราสองคน\n" +
            "แต่ต่อจากนี้...\n" +
            "คงทำได้เพียงแค่ภาวนา ภาวนาไปก่อน\n" +
            "ก็รู้ดีว่าถึงฝืนไปคงเท่านั้น\n" +
            "เพราะว่าความเป็นจริงไม่ใช่ความฝัน\n" +
            "คงทำได้เพียงแค่ภาวนา ภาวนาไปก่อน\n" +
            "ก็รู้ดีว่าถึงฝืนไปคงเท่านั้น\n" +
            "เพราะว่าความเป็นจริง เธอไม่ได้รักกัน"
            ,"บางที ถ้าเธอยอม ใจเย็น ๆ และฟังฉันสักหน่อย\n" +
                "บางวัน ที่ไม่เจอ ทำให้เธอ ต้องเงียบเหงาบ่อย ๆ\n" +
                "ไม่จริง ไม่เลย ยังไม่เคย จะไปหาใคร ๆ\n" +
                "เธออย่าไปคิดอะไร ก็อยากให้รู้เอาไว้\n" +
                "ก่อนนั้น เธอจะทำ ทำอะไร เธอใจถึงสปอร์ต\n" +
                "ตอนนี้ เธอจะทำ ทำอะไร ฉันใจหายตลอด\n" +
                "ไม่ดู ไม่แล และไม่แคร์ เธอจะให้ฉันยังไง\n" +
                "ก็เธอไม่คิดอะไร แต่ฉันคิดได้ไหม\n" +
                "อะก็เครื่องมันแฮงค์ ไม่อย่างงั้นก็ Net กาก\n" +
                "Face มันล่ม ก็ Line รั่ว อย่าคิดมาก\n" +
                "อยากสื่อสาร ไม่ต้องพึ่งนกพิราบ\n" +
                "แค่คิดถึง ทำแค่นั้นฉันก็ทราบ\n" +
                "จะไปอยู่ตรงหน้า จะไปหาแน่ ๆ\n" +
                "เธอจะอยู่ที่ไหน จะเปิดไซเรนไปหาเธอแน่\n" +
                "จะให้ฉันคิดยังไง\n" +
                "แค่คิดถึงฉันเอาไว้"
                ,"รู้มั้ยว่าเธอน่ารักตอนเมา\n" +
                "โอ้ธารารัตน์เบาเบา\n" +
                "แต่ไม่ตกหลงหลุมรักคนเมาไม่เอาหรอก\n" +
                "ฉันรู้ว่าเธอหน่ะร้ายจะตาย\n" +
                "เธอมีผู้ชายมากมาย\n" +
                "อย่ามาลูกไม้คนอย่างเธอฉันไม่เอาหรอก\n" +
                "รู้มั้ยว่าเธอน่ารักตอนเมา\n" +
                "โอ้ธารารัตน์เบาเบา\n" +
                "แต่ไม่ตกหลงหลุมรักคนเมาไม่เอาหรอก\n" +
                "ฉันรู้ว่าเธอหน่ะร้ายจะตาย\n" +
                "เธอมีผู้ชายมากมาย\n" +
                "ถ้าหลงไปรักเธอคงทำฉันเดือดร้อน"
                 ,"อยู่คนเดียวได้บ้างแล้ว\n" +
                "ฟังเพลงเดิมได้นิดหน่อย\n" +
                "เปิดรูปดูได้เล็กน้อย\n" +
                "ค่อยๆดีขึ้นทุกวัน\n" +
                "เมื่อคืนนอนไม่ฝันร้าย\n" +
                "หยุดร้องไห้ได้แล้วบางวัน\n" +
                "แอบดีขึ้นมาแล้วบ้าง\n" +
                "แค่ยังคิดถึงเธอทุกนาที\n" +
                "สบายดีไม่เป็นไร\n" +
                "สบายใจได้แล้วนะเธอ\n" +
                "จากวันที่เธอลาไปก็มาไกลกว่าตรงที่เดิม\n" +
                "ฉันขอโทษที่ทำให้เป็นห่วง\n" +
                "ช่วงนั้นไม่พร้อมที่จะเจอ\n" +
                "ขอบคุณจริงๆที่หวังดี"
                ,"อนให้ลม ช่วยพัดหัวใจพี่ลอยไป\n" +
                "จากดินแดน ถิ่นเหนือที่ไกลแสนไกล\n" +
                "สุดขอบฟ้า ที่ไกลแสนไกล ล่องลอยไป\n" +
                "วอนให้ลม ช่วยพัดหัวใจ พี่ไปให้ถึง\n" +
                "ฝากดวงใจ พี่ลอยล่องไปบนนภา\n" +
                "สุดขอบฟ้า หัวใจพี่จะไปถึง\n" +
                "ได้สบตาแค่เพียงครั้งหนึ่ง หัวใจพี่แทบติดตรึง\n" +
                "เพ้อรำพึงรำพัน ถึงแม่นวลน้อง\n" +
                "แก้มน้องนางนั้นแดงกว่าใคร"
                ,"ม่รู้ว่าต้องโตท่ามกลาง หมู่ดอกไม้ มากมาย ขนาดไหน\n" +
                "เธอจึงได้ครอบครอง รอยยิ้มที่สวยงามขนาดนี้\n" +
                "ทำให้รักใครไม่ได้อีกเลย วินาทีที่เธอ เจอกับฉัน มันทำ ทำให้\n" +
                "ความเดียวดายสลาย เพราะได้เจออะไรที่คู่ควร\n" +
                "ฉันขอบคุณและให้คำสัญญา ว่าจะรักษาไว้\n" +
                "ฉันไม่ต้องการใครอีก\n" +
                "ดวงดาวทั้งฟ้าต้องเสียใจและ ไม่มีสิ่งไหนสวยงามต่อไป\n" +
                "ตราบที่โลกนี้มีคนอย่างเธอ\n" +
                "และฉันคือคนโชคดี เมื่ออ่านความหมายทุกคำกวี\n" +
                "ไม่มีบทไหนงดงามอีกแล้ว ตราบที่โลกนี้ยังมีชื่อเธอ"
                ,"เธอรักเขาที่ตรงไหน\n" +
                "บอกฉันได้ไหม\n" +
                "ฉันอยากฟัง\n" +
                "บอกฉันให้รู้สักครั้ง\n" +
                "ถึงแม้จะไม่มีความหมาย\n" +
                "ขอร้องช่วยเห็นแก่ฉัน\n" +
                "ที่ทำเพื่อเธอมาตั้งมากมาย\n" +
                "บอกฉันเอาบุญจะได้ไหม\n" +
                "เขามีดียังไงเธอจึงรัก\n" +
                "ฉันเพียงอยากรู้\n" +
                "เพราะค้างคาในใจ\n" +
                "ว่าหัวใจของเธอ\n" +
                "น่ะมันราคาเท่าไหร่\n" +
                "จะไปมัวเสียเวลา\n" +
                "และเสียน้ำตาทำไม\n" +
                "หรือเพราะเธอหมดรัก\n" +
                "และยังทนมานาน\n" +
                "ไอ้ที่พูดกับที่ทำ\n" +
                "มันไปกันคนละทาง\n" +
                "ฉันว่าเธอวันนี้\n" +
                "คงไม่ใช่คนเมื่อวาน\n" +
                "บอกฉันมาสักที\n" +
                "ไม่ต้องมาทนรำคาญ\n" +
                "ไม่ใช่ฉัน\n" +
                "คนที่เธอเคยใฝ่ฝัน\n" +
                "ลึกลงไปข้างในนั้น\n" +
                "ฉันไม่รู้คือใคร\n" +
                "เธอรักเขาที่ตรงไหน\n" +
                "บอกฉันได้ไหม\n" +
                "ฉันอยากฟัง\n" +
                "บอกฉันให้รู้สักครั้ง\n" +
                "ถึงแม้จะไม่มีความหมาย\n" +
                "ขอร้องช่วยเห็นแก่ฉัน\n" +
                "ที่ทำเพื่อเธอมาตั้งมากมาย\n" +
                "บอกฉันเอาบุญจะได้ไหม\n" +
                "เขามีดียังไงเธอจึงรัก"
                ,"หากว่าลองได้คิดดู ใจฉันไม่ได้รู้สึก\n" +
                "เหมือนครั้งที่เราได้เจอกันเมื่อก่อนนั้น\n" +
                "อยากจะกลับไปเหมือนเก่า แต่มันก็ทำไม่ได้เลย\n" +
                "ไม่รู้ว่าเป็นอะไรฉันต้องบอกเธอไปนะ\n" +
                "ว่าอยากจะขอโทษเธอ\n" +
                "แต่ฉันทำต่อไปไม่ไหว\n" +
                "อาจเป็นเพราะว่าใจของฉันเปลี่ยนไปแล้ว\n" +
                "ก็เพราะว่าใจของฉันเปลี่ยนไปแล้ว\n" +
                "ไม่รู้ทำไม ไม่รู้ทำไม\n" +
                "เหมือนฉันเป็นคนใจร้าย\n" +
                "แค่อยากจะขอโทษเธอ\n" +
                "แต่ฉันทำต่อไปไม่ไหว\n" +
                "อาจเป็นเพราะว่าใจของฉันเปลี่ยนไปแล้ว\n" +
                "ก็เพราะว่าใจของฉันเปลี่ยนไปแล้ว\n" +
                "ไม่รู้ทำไม ไม่รู้ทำไม\n" +
                "เปลี่ยนตัวฉัน ให้เป็นเหมือนคนที่ห่างไกล\n" +
                "ไม่เหมือนดังเดิม ที่เธอเคยชิดใกล้\n" +
                "ไม่รู้ทำไม ไม่รู้ทำไม\n" +
                "ทำไมต้องเป็นเธอ ที่โดนทำร้าย\n" +
                "จากฉันที่เธอไว้ใจ เหลือเกิน\n" +
                "ทำไมต้องเป็นเรา ที่ถูกทำให้ใจ\n" +
                "เปลี่ยนไปทุกอย่าง ความรู้สึกไม่เหมือนก่อน\n" +
                "ที่เราฝัน ที่เราเคยวาดเอาไว้ไม่เป็นจริง\n" +
                "เหมือนทุกสิ่งที่ฉันทำ มันช่างต่างความรู้สึก\n" +
                "จากตัวฉันที่เธอเคยได้รู้จัก\n" +
                "และรักกำลังสลายไป\n" +
                "ไม่มีเราอีกแล้ว\n" +
                "อาจเป็นเพราะว่าใจของฉันเปลี่ยนไปแล้ว\n" +
                "ก็เพราะว่าใจของฉันเปลี่ยนไปแล้ว\n" +
                "ไม่รู้ทำไม ไม่รู้ทำไม\n" +
                "เปลี่ยนตัวฉัน ให้เป็นเหมือนคนที่ห่างไกล\n" +
                "ไม่เหมือนดังเดิม ที่เธอเคยชิดใกล้\n" +
                "ไม่รู้ทำไม ไม่รู้ทำไม\n" +
                "ทำไมต้องเป็นเธอ ที่โดนทำร้าย\n" +
                "จากฉันที่เธอไว้ใจ เหลือเกิน"
                ,"มันเหมือนไม่มีความหมายกับเธออีกต่อไปเธอทำให้ฉันตายใจเธอทำให้ฉันไว้ใจ\n" +
                "กับเธอแค่ไหนก็เพราะว่าเธอมีเขาเข้ามาที่เข้ามาเปลี่ยนชีวิตของเธอกับฉัน\n" +
                "สุดท้ายคือต้องยอมปล่อยปล่อยเธอโดยที่ยังรักเธออยู่ทั้งใจ\n" +
                "มันเจ็บจนต้องร้องไห้เพราะหัวใจแบกรับไม่ไหวสิ่งเดียวที่รับรู้ได้คือฉันกลายเป็นคนที่เธอไม่เอา\n" +
                "ฉันมันก็เหมือนคนโง่คนนึงที่ให้เธอหลอกเธอก็รู้ว่าฉันก็รักและยอมเธอทุกอย่าง\n" +
                "ไม่เป็นไรถ้าที่ฉันทำเธอจะมองข้ามไป"
                ,"เธอเปรียบดังเสมือนดวงใจ\n" +
                "ตามติดตรึงแนบชิดข้างกาย\n" +
                "หวังว่าเธอจะไม่ไปไหน\n" +
                "รักจำนนถึงเธอคนดี ผู้เป็นที่รักในใจ\n" +
                "ไม่มีเธอคงคิดตรอมใจ\n" +
                "ฉันสัญญาจะไม่ไปไหน\n" +
                "ขอเพียงเธอเข้ามา. นั่งในดวงใจ\n" +
                "โปรดส่งยิ้มมาสักหน่อย\n" +
                "ช่วยบอกรักฉันบ่อยบ่อย\n" +
                "วอนเธอจงอย่าจืดจาง\n" +
                "ใจคงบางถ้าขาดเธอ\n" +
                "หากแม้นวันใดที่ไม่มีกันคงช้ำ\n" +
                "เธอเปรียบดังเสมือนดวงใจ\n" +
                "ตามติดตรึงแนบชิดข้างกาย\n" +
                "หวังว่าเธอจะไม่ไปไหน")

    val context = this

    public  final val KEY_TITLE ="TITLE"
    public final  val KEY_RESULT ="RESULT"
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

        setTitle("รายการเพลงไทยยอดนิยม")

        val mAdp = ArrayAdapter(context,
            android.R.layout.simple_list_item_1,
            titleArr)
        lv_result.adapter = mAdp

        lv_result.setOnItemClickListener { parent, view, position, id ->

         //   Toast.makeText( context,
          //      " ชื่อเพลง ${titleArr[position]}"
           //     ,Toast.LENGTH_LONG).show()
            val  goPageResult = Intent(context,Listview2::class.java)

            goPageResult.putExtra(KEY_TITLE,titleArr[position])
            goPageResult.putExtra(KEY_RESULT,priceArr[position])

            startActivity(goPageResult)

            }

        }

    }


